app/Controllers/CStatus.php

SELECT *
FROM `tbl_transaksi`
---
    function update_resi()
    {
        $getDataTransaksi = $this->modelTransaksi->findAll();