app/Controllers/CWarehouseList.php

    public function dataAjax()
    {
        $request = Services::request();
        $datatable = new MCustomer($request);
        $transaksi = new MTransaksi($request);
        $desc = "Warehouse";

        if ($request->getMethod(true) === 'POST') {
            $lists = $datatable->getDatatables($desc);
            $data = [];
            $no = $request->getPost('start');

            foreach ($lists as $list) {
                $getTransaksi = $transaksi->getWhere(['warehouse'=> $list->id_customer])->getResult();
---
SELECT *
FROM `tbl_transaksi`
WHERE `warehouse` = '2'