app/Controllers/Home.php

    public function index()
    {
        $request = Services::request();
        $modelTransaksi = new MTransaksi($request);
        $data = [
            'menu'                  => 'dashboard',
            'link'                  => 'Home/index',
            'submenu'               => 'dashboard',
            'alltransaksi'          => count($modelTransaksi->findAll()),
            'transaksiIn'           => count($modelTransaksi->getWhere(['status_hub'=> 1])->getResult()),
            'transaksiSort'         => count($modelTransaksi->getWhere(['status_hub'=> 2])->getResult()),
            'transaksiOut'          => count($modelTransaksi->getWhere(['status_hub'=> 3])->getResult()),
            'transaksiRtn'          => count($modelTransaksi->getWhere(['status_hub'=> 4])->getResult()),
            'transaksiReturned'     => count($modelTransaksi->getWhere(['status_hub'=> 5])->getResult()),
---
SELECT *
FROM `tbl_transaksi`
SELECT *
FROM `tbl_transaksi`
WHERE `status_hub` = 1
SELECT *
FROM `tbl_transaksi`
WHERE `status_hub` = 2
SELECT *
FROM `tbl_transaksi`
WHERE `status_hub` = 3
SELECT *
FROM `tbl_transaksi`
WHERE `status_hub` = 4
SELECT *
FROM `tbl_transaksi`
WHERE `status_hub` = 5