app/Models/MCustomer.php

SELECT *
FROM `tbl_customer`
WHERE `desc_cust` = 'Warehouse'
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function getDatatables($desc)
    {
        $this->getDatatablesQuery();
        if ($this->request->getPost('length') != -1)
            $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
        $query = $this->dt->where('desc_cust',$desc)->get();

SELECT COUNT(*) AS `numrows`
FROM `tbl_customer`
---
    public function countFiltered()
    {
        $this->getDatatablesQuery();
        return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `tbl_customer`
---
    public function countAll()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();